org-roam/20250623135509-3553_fall_2023.org
:PROPERTIES:
:ID:       6617d4b4-3042-463d-8b5a-10533ad98537
:END:
#+title: 3553 Fall 2023


* Class 1 8/31/2023
** Class
*** Syllabus
*** Overview of Notation Programs

*** Introduction Reading

*** Comparison of Default Output

