docs/site/20250623135509-3553_fall_2023.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-21 Sat 11:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>3553 Fall 2023</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../style.css" type="text/css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">3553 Fall 2023</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org24d12d6">Class 1 8/31/2023</a>
<ul>
<li><a href="#org2eea77e">Class</a>
<ul>
<li><a href="#org047b483">Syllabus</a></li>
<li><a href="#orga0b04de">Overview of Notation Programs</a></li>
<li><a href="#org9c68f1e">Introduction Reading</a></li>
<li><a href="#org620508a">Comparison of Default Output</a></li>
<li><a href="#org26d636b">Sibelius Overview</a></li>
</ul>
</li>
<li><a href="#org3c2ee68">Homework</a></li>
</ul>
</li>
<li><a href="#org0790bb6">Class 2 9/5/2023</a>
<ul>
<li><a href="#org1b08b8e">Note Input</a>
<ul>
<li><a href="#org9265ed5">Voices</a></li>
<li><a href="#org1399709">Accidentals (demonstrations only, sibelius seems to do really well with this)</a></li>
<li><a href="#orgbf7248a">Tricks</a></li>
</ul>
</li>
<li><a href="#org1b4393b">Changing Key Signatures, Time Signatures, Clefs</a>
<ul>
<li><a href="#org61e7f23">Note double barlines for keys, not times</a></li>
<li><a href="#org68482a5">Ledger lines for clefs (3)</a></li>
<li><a href="#orgb14db84">Before barlines</a></li>
<li><a href="#orgf56bea7">Mid measure clef changes</a></li>
<li><a href="#orgbe8624c">Changing after rests</a></li>
</ul>
</li>
<li><a href="#orgf6eda1f">Homework</a></li>
</ul>
</li>
<li><a href="#orgb0c1e93">Class 3 9/7/2023</a>
<ul>
<li><a href="#org95594e8">Drumset</a>
<ul>
<li><a href="#org5c40877">MIDI vs Score Entry</a></li>
</ul>
</li>
<li><a href="#orgb679a65">Guitar and TAB</a>
<ul>
<li><a href="#orge4b5561">Alternate Tunings</a></li>
<li><a href="#org5dfe54f">Fretboard input</a></li>
<li><a href="#orgc0590c2">Chord Diagrams</a></li>
<li><a href="#orgb5e2895">Dynamic vs non dynamic parts</a></li>
<li><a href="#orgb9da85e">Using both</a></li>
</ul>
</li>
<li><a href="#org6ac76b2">Keyboard</a>
<ul>
<li><a href="#org2ac0dee">Cross staff</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org055335a">Class 4 9/12/2023</a>
<ul>
<li><a href="#org21af861">Tuplets</a>
<ul>
<li><a href="#org22548ba">locking the triplet with shift option k</a></li>
<li><a href="#orge9f16a2">custom tuplets the slow way</a></li>
<li><a href="#org2fd87fe">nested triplets</a></li>
<li><a href="#org58c36d0">Triplet ratios</a></li>
</ul>
</li>
<li><a href="#org2ebab4d">Lyrics</a>
<ul>
<li><a href="#orga2e32f5">Direct enter</a></li>
<li><a href="#org875b18c">Copy and paste</a></li>
<li><a href="#org52d4631">From File</a></li>
<li><a href="#org217f7bb">Plugins</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org6614da7">Class 5 9/14/2023</a>
<ul>
<li><a href="#org2733f04">Slurs</a>
<ul>
<li><a href="#orgaa68722">Different Meanings</a></li>
<li><a href="#org05e9c9d">s or select passage</a></li>
<li><a href="#orge2c1c04">During input S and shift S</a></li>
<li><a href="#orge64a28b">Flipping with X</a></li>
<li><a href="#org5d8ad01">Adjusting handles</a></li>
<li><a href="#orgf77b23c">Adjusting ends when extending over breaks</a></li>
</ul>
</li>
<li><a href="#org37e2d00">Articulations</a>
<ul>
<li><a href="#org1f1e0c2">Except in two stemmed, it goes over the noteheads</a></li>
<li><a href="#org43f5669">Double stemmed</a></li>
<li><a href="#org1833886">During input and after input</a></li>
<li><a href="#org9a5f9e4">Clearing articulations</a></li>
<li><a href="#org37d74f7">Flip with X</a></li>
</ul>
</li>
<li><a href="#orgd995159">Grace Notes</a>
<ul>
<li><a href="#orgf7996c3">Always stem up except double stemmed writing</a></li>
<li><a href="#orgdd0a84e">Slurs below notehead (sibelius won't do this automatically!)</a></li>
<li><a href="#org3303151">Independent slurs, even when slur is long</a></li>
<li><a href="#org03e4f70">Articulations where they are conspicuous (sibelius doesn't do this automatically!)</a></li>
<li><a href="#org4633f3f">Dynamics tend to go to main note unless there are a lot of grace notes</a></li>
</ul>
</li>
<li><a href="#org7cd4153">Beams</a>
<ul>
<li><a href="#orge38c1be">Sibelius usually good on secondary beams, but not always (3/8 eg)</a></li>
<li><a href="#org99f51a5">Manually add a secondary beam for 4 64ths notes</a></li>
<li><a href="#orgf67679c">Global change</a></li>
<li><a href="#org893e6b6">Feathered Beams</a></li>
<li><a href="#org8007efc">over rests</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org099212d">Class 6 9/19/2023</a>
<ul>
<li><a href="#org18ffebc">Dynamics</a>
<ul>
<li><a href="#orgb8d6c9c">Hairpins</a></li>
</ul>
</li>
<li><a href="#org3b1418d">Text in General</a>
<ul>
<li><a href="#org15cc102">Fonts</a></li>
<li><a href="#orgdd1be1f">One at a time</a></li>
<li><a href="#org637cf09">Copy with shift alt click vs alt click</a></li>
<li><a href="#org704e022">Alt click to get same style</a></li>
<li><a href="#org7f5a89a">Multi select (first notes of measures only?)</a></li>
<li><a href="#org16a4662">Align in column</a></li>
</ul>
</li>
<li><a href="#orgfa8af95">Tempo Marks</a>
<ul>
<li><a href="#orgd9e8a54">System Object Positions in Appearance Tab</a></li>
<li><a href="#org45b3d66">Align them</a></li>
<li><a href="#org71faca7">Modulations with = signs</a></li>
</ul>
</li>
<li><a href="#org8e639c0">Expressions and Technique text</a>
<ul>
<li><a href="#org05657dc">position (esp with lyrics)</a></li>
<li><a href="#orgc26b7bf">Center dynamics, sibelius won't do this for you!!!</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org91006a5">Class 7 9/21/2023</a>
<ul>
<li><a href="#org5ffb51e">Glissandi</a>
<ul>
<li><a href="#orga2bfbe2">At least first occurance should have word gliss.</a></li>
<li><a href="#org008f5f6">Make sure it isn't confused with voice leading lines</a></li>
<li><a href="#org342d0f4">With accidentals, default is next to, but can also adjust</a></li>
<li><a href="#orgccecbc5">Unisons go in direction of gliss (auto)</a></li>
<li><a href="#org6fbea57">Avoid clef changes</a></li>
<li><a href="#org2fc63b4">Use ties if gliss delayed</a></li>
<li><a href="#orgc1309cc">Chord glisses only one label (not automatic)</a></li>
<li><a href="#org7871709">Finishing grace note and parenthesis</a></li>
<li><a href="#org7b68880">Intermediate notes and parenthesis</a></li>
</ul>
</li>
<li><a href="#org0e7a68e">Trills</a>
<ul>
<li><a href="#org95e1ae3">Only long slurs and octave signs go above the trill</a></li>
<li><a href="#orge6ca867">Line lasts for entire note (sib doesn't follow ties), stops right at next notehead or its accidental (sib won't notice) or to barline</a></li>
<li><a href="#orgd0900eb">Accidental by creating a new symbol and a new line</a></li>
<li><a href="#org1bd1d94">Grace note for a defined pitch in parenthesis with an X shift, hide flag, drag stem down</a></li>
<li><a href="#orgf95bca4">Grace note terminations</a></li>
</ul>
</li>
<li><a href="#org8290802">Tremolos</a>
<ul>
<li><a href="#org29b98ca">input at half value, choose beam numbers</a></li>
<li><a href="#org81477f8">tied to next measure with slurs</a></li>
<li><a href="#org661d9c4">break beams (auto?)</a></li>
</ul>
</li>
<li><a href="#org9103aea">Arpeggios</a>
<ul>
<li><a href="#orgdfc64ac">Extends all notes (not stems)</a></li>
<li><a href="#org1ec42c0">Cross staff if there's an accidental</a></li>
</ul>
</li>
<li><a href="#orgc7a5dc1">Octave Signs</a>
<ul>
<li><a href="#org22c1601">Above almost all other notation</a></li>
<li><a href="#orge93d31d">Slur vs triplet vs octave depend on longest</a></li>
<li><a href="#org752859d">Change style if wanted</a></li>
<li><a href="#orgedefd73">How long it goes controversy</a></li>
<li><a href="#org43332e8">Ledger lines, octave signs, or clef changes?</a></li>
<li><a href="#org16d1870">loco to turn back</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7a2733e">Class 8 9/26/2023</a>
<ul>
<li><a href="#org46ddffa">Repeats</a></li>
<li><a href="#org40a9ea8">Pauses</a></li>
<li><a href="#org50a4e1a">Instruments on the side</a></li>
<li><a href="#org05163da">System break character by itself?</a></li>
<li><a href="#org50aac70">Rehearsal Marks</a></li>
<li><a href="#orgd6437b6">Brackets</a></li>
<li><a href="#org30aa2ea">Figured Bass</a></li>
<li><a href="#org6c53efb">Bar numbers</a></li>
<li><a href="#org7f79a5d">Noteheads</a></li>
<li><a href="#org672a97a">Barlines</a></li>
</ul>
</li>
<li><a href="#org5b484b1">Class 9 9/28/2023</a>
<ul>
<li><a href="#org7cf7768">Page Layout</a></li>
<li><a href="#org4810696">Focus On Staffs</a></li>
<li><a href="#orgea10850">Hiding Staffs</a></li>
<li><a href="#org50af96c">Spacing, margins, page size</a></li>
<li><a href="#org571db8b">Magnetic Layout</a></li>
</ul>
</li>
<li><a href="#org72c8627">Class 10 10/3/2023</a>
<ul>
<li><a href="#org6853c1c">Dynamic Parts</a>
<ul>
<li><a href="#org3d1c642">When to use which?</a></li>
</ul>
</li>
<li><a href="#org0e30181">Extracting Parts</a></li>
<li><a href="#org68e2a0a">Cues</a></li>
</ul>
</li>
<li><a href="#org2b7a4d8">Class 11 10/5/2023</a>
<ul>
<li><a href="#org33f2a83">Midterm Projects</a></li>
</ul>
</li>
<li><a href="#orgbf99a87">Class 12 10/10/2023</a>
<ul>
<li><a href="#org1027603">Midterm Projects</a></li>
</ul>
</li>
<li><a href="#org4128a70">Class 13 10/12/20232</a>
<ul>
<li><a href="#org07c0e44">Midterm Projects</a></li>
</ul>
</li>
<li><a href="#orgf1481eb">Fundamentals of Notation</a>
<ul>
<li><a href="#org7e39416">Double Stemmed Writing&#xa0;&#xa0;&#xa0;<span class="tag"><span class="2">2</span></span></a>
<ul>
<li><a href="#org294c4c7">Rests - 36</a></li>
<li><a href="#org3f4ff63">Articulations - 118</a></li>
</ul>
</li>
<li><a href="#org0247b4c">Accidentals&#xa0;&#xa0;&#xa0;<span class="tag"><span class="2">2</span></span></a>
<ul>
<li><a href="#org7dce9b3">Where they apply - 78-79</a></li>
<li><a href="#orgcf72448">Right after a barline - 81</a></li>
<li><a href="#orge06ef5f">Octave displacement - 82</a></li>
<li><a href="#org1d4993e">Cautionary accidentals - 83</a></li>
<li><a href="#org589a9d3">Note spelling - 85</a></li>
</ul>
</li>
<li><a href="#org241d714">Drumset 281&#xa0;&#xa0;&#xa0;<span class="tag"><span class="3">3</span></span></a></li>
<li><a href="#orgff1bad1">Braces 303&#xa0;&#xa0;&#xa0;<span class="tag"><span class="3">3</span></span></a></li>
<li><a href="#org15cf397">Split beams 314&#xa0;&#xa0;&#xa0;<span class="tag"><span class="3">3</span></span></a></li>
<li><a href="#orgf5e8ba7">Pedaling 334&#xa0;&#xa0;&#xa0;<span class="tag"><span class="3">3</span></span></a></li>
<li><a href="#org45432d8">Vocal writing 434&#xa0;&#xa0;&#xa0;<span class="tag"><span class="4">4</span></span></a></li>
<li><a href="#org23a5a4a">Clef Changes&#xa0;&#xa0;&#xa0;<span class="tag"><span class="5">5</span></span></a>
<ul>
<li><a href="#org130c6fe">Ledger Lines  - 7</a></li>
<li><a href="#org6dc95d1">At Beginning of the bar, mid measure, after rests - 8</a></li>
</ul>
</li>
<li><a href="#org664ba8b">Key Changes&#xa0;&#xa0;&#xa0;<span class="tag"><span class="5">5</span></span></a>
<ul>
<li><a href="#orgf115745">Double bar line - 39</a></li>
</ul>
</li>
<li><a href="#org41b4ae8">Tuplets 193&#xa0;&#xa0;&#xa0;<span class="tag"><span class="5">5</span></span></a></li>
<li><a href="#org0faf6a0">Tempo Marks 182&#xa0;&#xa0;&#xa0;<span class="tag"><span class="5">5</span></span></a></li>
<li><a href="#org4913c83">Meter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="5">5</span></span></a>
<ul>
<li><a href="#orgc7d360a">Rests 160</a></li>
<li><a href="#org8f5bd7b">Syncopation - 170</a></li>
<li><a href="#orgfdde232">Simple to Compound - 172</a></li>
</ul>
</li>
<li><a href="#org93d333b">Articulations&#xa0;&#xa0;&#xa0;<span class="tag"><span class="6">6</span></span></a>
<ul>
<li><a href="#org7fde161">Placement - 117</a></li>
<li><a href="#orga51e8c0">Double stemmed placement - 118</a></li>
<li><a href="#orge7c28e5">Arpeggiated Chords - 131</a></li>
</ul>
</li>
<li><a href="#org488f3d9">Dynamics&#xa0;&#xa0;&#xa0;<span class="tag"><span class="6">6</span></span></a>
<ul>
<li><a href="#org3e8fd5e">Typefaces - 101</a></li>
<li><a href="#org6f5375d">Placement - 101-103</a></li>
<li><a href="#orgeb54006">Hairpins vs words 106</a></li>
<li><a href="#org53b81c3">subito 107</a></li>
</ul>
</li>
<li><a href="#orgf40fe56">Ties&#xa0;&#xa0;&#xa0;<span class="tag"><span class="7">7</span></span></a>
<ul>
<li><a href="#org49f8cff">Only same note - 60</a></li>
<li><a href="#org578319e">Flattening in chords - 61</a></li>
<li><a href="#org59554ee">Distance between ties - 66</a></li>
</ul>
</li>
<li><a href="#orga386160">Slurs&#xa0;&#xa0;&#xa0;<span class="tag"><span class="7">7</span></span></a>
<ul>
<li><a href="#org80b045a">Over a break - 112</a></li>
<li><a href="#org2820a05">Chords - 114</a></li>
</ul>
</li>
<li><a href="#orgd4a53fd">Octave Signs&#xa0;&#xa0;&#xa0;<span class="tag"><span class="8">8</span></span></a>
<ul>
<li><a href="#org8d8ef88">Where its placed -28</a></li>
<li><a href="#orgbdd6a7b">Precedence of slurs, octaves, and tuplets, Tempo Markings, pedal instructions - 29</a></li>
<li><a href="#org1f84c06">Extension Lines - 30</a></li>
<li><a href="#org1c4dd7b">Octave signs vs ledger liens - 33</a></li>
</ul>
</li>
<li><a href="#org4bf5a20">Grace Notes - 126&#xa0;&#xa0;&#xa0;<span class="tag"><span class="8">8</span></span></a></li>
<li><a href="#org0638f6b">Trills 135&#xa0;&#xa0;&#xa0;<span class="tag"><span class="8">8</span></span></a>
<ul>
<li><a href="#orgaf4cf6d">Accidentals with trills - 84</a></li>
</ul>
</li>
<li><a href="#org45cf41b">Glissandi&#xa0;&#xa0;&#xa0;<span class="tag"><span class="8">8</span></span></a></li>
<li><a href="#orged9b970">Pauses&#xa0;&#xa0;&#xa0;<span class="tag"><span class="9">9</span></span></a>
<ul>
<li><a href="#orgcbe3836">' and // 187</a></li>
<li><a href="#orgb26481d">Fermata 187-188</a></li>
</ul>
</li>
<li><a href="#org0c36453">Repeats 219&#xa0;&#xa0;&#xa0;<span class="tag"><span class="9">9</span></span></a>
<ul>
<li><a href="#org874048e">Slash notation 219</a></li>
<li><a href="#org9ba6aae">Tremolos 225</a></li>
<li><a href="#org75fcd03">Beat repetition 230</a></li>
<li><a href="#org064b022">Repeat barlines 233</a></li>
<li><a href="#org97494ae">DC and DS 238</a></li>
</ul>
</li>
<li><a href="#orgef8559c">Page Layout&#xa0;&#xa0;&#xa0;<span class="tag"><span class="10">10</span></span></a></li>
<li><a href="#org914ef5d">Extracting Parts&#xa0;&#xa0;&#xa0;<span class="tag"><span class="11">11</span></span></a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org24d12d6" class="outline-2">
<h2 id="org24d12d6">Class 1 8/31/2023</h2>
<div class="outline-text-2" id="text-org24d12d6">
</div>
<div id="outline-container-org2eea77e" class="outline-3">
<h3 id="org2eea77e">Class</h3>
<div class="outline-text-3" id="text-org2eea77e">
</div>
<div id="outline-container-org047b483" class="outline-4">
<h4 id="org047b483">Syllabus</h4>
</div>
<div id="outline-container-orga0b04de" class="outline-4">
<h4 id="orga0b04de">Overview of Notation Programs</h4>
</div>

<div id="outline-container-org9c68f1e" class="outline-4">
<h4 id="org9c68f1e">Introduction Reading</h4>
</div>

<div id="outline-container-org620508a" class="outline-4">
<h4 id="org620508a">Comparison of Default Output</h4>
</div>
