org-roam/20250623135509-3553_fall_2023.org
*** Sibelius Overview

**** Ribbon

**** Document Setup

***** Pickup Measure

***** Key signatures

***** House Styles

***** Tempos

**** Note Input

***** Panorama View

***** Point and click

***** Type letters

***** Midi

***** Ties - Only to the same note!!!!

** Homework 

Input basic melodies and setup documents for each.


* Class 2 9/5/2023
** Note Input
*** Voices
**** Color display in Choose View > Note Colors
**** Rests
**** Moving notes to other voices and swapping
*** Accidentals (demonstrations only, sibelius seems to do really well with this)
**** Where they apply
**** Cautionary accidentals
***** Right after barline
***** Octaves
**** Note Spelling
*** Tricks
**** Reenter notes keep rhythm
**** Repeat measures
**** Transpose
** Changing Key Signatures, Time Signatures, Clefs
*** Note double barlines for keys, not times
*** Ledger lines for clefs (3)
*** Before barlines
*** Mid measure clef changes
**** Between Beats
**** Between Phrases
**** Middle of Beats
*** Changing after rests
** Homework
Note entry with lots of changes in key signatures, time signatures, and clefs
Clef correction exercises


* Class 3 9/7/2023
** Drumset

*** MIDI vs Score Entry

**** Changing noteheads without step time

**** Mapping of devices

**** How it looks vs how it sounds

** Guitar and TAB

*** Alternate Tunings

*** Fretboard input

*** Chord Diagrams

*** Dynamic vs non dynamic parts

*** Using both

** Keyboard

*** Cross staff



* Class 4 9/12/2023
** Tuplets

*** locking the triplet with shift option k

*** custom tuplets the slow way

*** nested triplets

*** Triplet ratios

** Lyrics

*** Direct enter

**** Command L and Option Command L for verse 2

**** Non breaking spaces and hyphens

*** Copy and paste

*** From File

*** Plugins

**** Add slurs

**** Traditional Beaming

**** Check lyric hyphenation


* Class 5 9/14/2023
** Slurs

*** Different Meanings

**** Winds and Brass

**** Strings

**** Voice
*** s or select passage

*** During input S and shift S

*** Flipping with X

*** Adjusting handles

**** Resetting if you mess up

****  Disable magnetic for cross staff

*** Adjusting ends when extending over breaks

** Articulations

*** Except in two stemmed, it goes over the noteheads

**** Or limited space below, and except the marcato (sibelius won't let you flip it)

*** Double stemmed

**** Each voice needs its own articulations, including unisons!

**** Aritculations go to the stem side

***** Don't move it closer than the end of the stem!

*** During input and after input

*** Clearing articulations

*** Flip with X

** Grace Notes

*** Always stem up except double stemmed writing

*** Slurs below notehead (sibelius won't do this automatically!)

*** Independent slurs, even when slur is long

*** Articulations where they are conspicuous (sibelius doesn't do this automatically!)

*** Dynamics tend to go to main note unless there are a lot of grace notes

** Beams

*** Sibelius usually good on secondary beams, but not always (3/8 eg)

*** Manually add a secondary beam for 4 64ths notes

*** Global change

*** Feathered Beams

*** over rests


* Class 6 9/19/2023
** Dynamics

*** Hairpins

**** H and Shift H and Shift L during input, alt arrows to select handles

**** Multiple at once

** Text in General

*** Fonts

