docs/site/20250623135509-3553_fall_2023.html

<div id="outline-container-org26d636b" class="outline-4">
<h4 id="org26d636b">Sibelius Overview</h4>
<div class="outline-text-4" id="text-org26d636b">
</div>
<ul class="org-ul">
<li><a id="orgb15a841"></a>Ribbon<br /></li>

<li><a id="org5ebfacb"></a>Document Setup<br />
<ul class="org-ul">
<li><a id="org745c85e"></a>Pickup Measure<br /></li>

<li><a id="org58fca2f"></a>Key signatures<br /></li>

<li><a id="org15fea44"></a>House Styles<br /></li>

<li><a id="org6820864"></a>Tempos<br /></li>
</ul>
</li>
<li><a id="org33620b9"></a>Note Input<br />
<ul class="org-ul">
<li><a id="org842a225"></a>Panorama View<br /></li>

<li><a id="org75477e6"></a>Point and click<br /></li>

<li><a id="org30eefa1"></a>Type letters<br /></li>

<li><a id="org77cde8c"></a>Midi<br /></li>

<li><a id="org30b0c30"></a>Ties - Only to the same note!!!!<br /></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org3c2ee68" class="outline-3">
<h3 id="org3c2ee68">Homework</h3>
<div class="outline-text-3" id="text-org3c2ee68">
<p>
Input basic melodies and setup documents for each.
</p>
</div>
</div>
</div>
<div id="outline-container-org0790bb6" class="outline-2">
<h2 id="org0790bb6">Class 2 9/5/2023</h2>
<div class="outline-text-2" id="text-org0790bb6">
</div>
<div id="outline-container-org1b08b8e" class="outline-3">
<h3 id="org1b08b8e">Note Input</h3>
<div class="outline-text-3" id="text-org1b08b8e">
</div>
<div id="outline-container-org9265ed5" class="outline-4">
<h4 id="org9265ed5">Voices</h4>
<div class="outline-text-4" id="text-org9265ed5">
</div>
<ul class="org-ul">
<li><a id="orgb803288"></a>Color display in Choose View &gt; Note Colors<br /></li>
<li><a id="org317be5e"></a>Rests<br /></li>
<li><a id="org2ca0874"></a>Moving notes to other voices and swapping<br /></li>
</ul>
</div>
<div id="outline-container-org1399709" class="outline-4">
<h4 id="org1399709">Accidentals (demonstrations only, sibelius seems to do really well with this)</h4>
<div class="outline-text-4" id="text-org1399709">
</div>
<ul class="org-ul">
<li><a id="org2a3cc37"></a>Where they apply<br /></li>
<li><a id="org3da5b0e"></a>Cautionary accidentals<br />
<ul class="org-ul">
<li><a id="org602c799"></a>Right after barline<br /></li>
<li><a id="org9f3d73e"></a>Octaves<br /></li>
</ul>
</li>
<li><a id="org7f5499d"></a>Note Spelling<br /></li>
</ul>
</div>
<div id="outline-container-orgbf7248a" class="outline-4">
<h4 id="orgbf7248a">Tricks</h4>
<div class="outline-text-4" id="text-orgbf7248a">
</div>
<ul class="org-ul">
<li><a id="org6c0ac4d"></a>Reenter notes keep rhythm<br /></li>
<li><a id="org91cbde7"></a>Repeat measures<br /></li>
<li><a id="org49b4a11"></a>Transpose<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org1b4393b" class="outline-3">
<h3 id="org1b4393b">Changing Key Signatures, Time Signatures, Clefs</h3>
<div class="outline-text-3" id="text-org1b4393b">
</div>
<div id="outline-container-org61e7f23" class="outline-4">
<h4 id="org61e7f23">Note double barlines for keys, not times</h4>
</div>
<div id="outline-container-org68482a5" class="outline-4">
<h4 id="org68482a5">Ledger lines for clefs (3)</h4>
</div>
<div id="outline-container-orgb14db84" class="outline-4">
<h4 id="orgb14db84">Before barlines</h4>
</div>
<div id="outline-container-orgf56bea7" class="outline-4">
<h4 id="orgf56bea7">Mid measure clef changes</h4>
<div class="outline-text-4" id="text-orgf56bea7">
</div>
<ul class="org-ul">
<li><a id="org7b0d852"></a>Between Beats<br /></li>
<li><a id="org5919b66"></a>Between Phrases<br /></li>
<li><a id="org0039c22"></a>Middle of Beats<br /></li>
</ul>
</div>
<div id="outline-container-orgbe8624c" class="outline-4">
<h4 id="orgbe8624c">Changing after rests</h4>
</div>
</div>
<div id="outline-container-orgf6eda1f" class="outline-3">
<h3 id="orgf6eda1f">Homework</h3>
<div class="outline-text-3" id="text-orgf6eda1f">
<p>
Note entry with lots of changes in key signatures, time signatures, and clefs
Clef correction exercises
</p>
</div>
</div>
</div>
<div id="outline-container-orgb0c1e93" class="outline-2">
<h2 id="orgb0c1e93">Class 3 9/7/2023</h2>
<div class="outline-text-2" id="text-orgb0c1e93">
</div>
<div id="outline-container-org95594e8" class="outline-3">
<h3 id="org95594e8">Drumset</h3>
<div class="outline-text-3" id="text-org95594e8">
</div>
<div id="outline-container-org5c40877" class="outline-4">
<h4 id="org5c40877">MIDI vs Score Entry</h4>
<div class="outline-text-4" id="text-org5c40877">
</div>
<ul class="org-ul">
<li><a id="org4153294"></a>Changing noteheads without step time<br /></li>

<li><a id="org43a558e"></a>Mapping of devices<br /></li>

<li><a id="org0399086"></a>How it looks vs how it sounds<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgb679a65" class="outline-3">
<h3 id="orgb679a65">Guitar and TAB</h3>
<div class="outline-text-3" id="text-orgb679a65">
</div>
<div id="outline-container-orge4b5561" class="outline-4">
<h4 id="orge4b5561">Alternate Tunings</h4>
</div>

<div id="outline-container-org5dfe54f" class="outline-4">
<h4 id="org5dfe54f">Fretboard input</h4>
</div>

<div id="outline-container-orgc0590c2" class="outline-4">
<h4 id="orgc0590c2">Chord Diagrams</h4>
</div>

<div id="outline-container-orgb5e2895" class="outline-4">
<h4 id="orgb5e2895">Dynamic vs non dynamic parts</h4>
</div>

<div id="outline-container-orgb9da85e" class="outline-4">
<h4 id="orgb9da85e">Using both</h4>
</div>
</div>
<div id="outline-container-org6ac76b2" class="outline-3">
<h3 id="org6ac76b2">Keyboard</h3>
<div class="outline-text-3" id="text-org6ac76b2">
</div>
<div id="outline-container-org2ac0dee" class="outline-4">
<h4 id="org2ac0dee">Cross staff</h4>
</div>
</div>
</div>
<div id="outline-container-org055335a" class="outline-2">
<h2 id="org055335a">Class 4 9/12/2023</h2>
<div class="outline-text-2" id="text-org055335a">
</div>
<div id="outline-container-org21af861" class="outline-3">
<h3 id="org21af861">Tuplets</h3>
<div class="outline-text-3" id="text-org21af861">
</div>
<div id="outline-container-org22548ba" class="outline-4">
<h4 id="org22548ba">locking the triplet with shift option k</h4>
</div>

<div id="outline-container-orge9f16a2" class="outline-4">
<h4 id="orge9f16a2">custom tuplets the slow way</h4>
</div>

<div id="outline-container-org2fd87fe" class="outline-4">
<h4 id="org2fd87fe">nested triplets</h4>
</div>

<div id="outline-container-org58c36d0" class="outline-4">
<h4 id="org58c36d0">Triplet ratios</h4>
</div>
</div>
<div id="outline-container-org2ebab4d" class="outline-3">
<h3 id="org2ebab4d">Lyrics</h3>
<div class="outline-text-3" id="text-org2ebab4d">
</div>
<div id="outline-container-orga2e32f5" class="outline-4">
<h4 id="orga2e32f5">Direct enter</h4>
<div class="outline-text-4" id="text-orga2e32f5">
</div>
<ul class="org-ul">
<li><a id="org189ed42"></a>Command L and Option Command L for verse 2<br /></li>

<li><a id="org53e5497"></a>Non breaking spaces and hyphens<br /></li>
</ul>
</div>
<div id="outline-container-org875b18c" class="outline-4">
<h4 id="org875b18c">Copy and paste</h4>
</div>

<div id="outline-container-org52d4631" class="outline-4">
<h4 id="org52d4631">From File</h4>
</div>

<div id="outline-container-org217f7bb" class="outline-4">
<h4 id="org217f7bb">Plugins</h4>
<div class="outline-text-4" id="text-org217f7bb">
</div>
<ul class="org-ul">
<li><a id="orgd8e240d"></a>Add slurs<br /></li>

<li><a id="org3e76dd5"></a>Traditional Beaming<br /></li>

<li><a id="orgd418420"></a>Check lyric hyphenation<br /></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org6614da7" class="outline-2">
<h2 id="org6614da7">Class 5 9/14/2023</h2>
<div class="outline-text-2" id="text-org6614da7">
</div>
<div id="outline-container-org2733f04" class="outline-3">
<h3 id="org2733f04">Slurs</h3>
<div class="outline-text-3" id="text-org2733f04">
</div>
<div id="outline-container-orgaa68722" class="outline-4">
<h4 id="orgaa68722">Different Meanings</h4>
<div class="outline-text-4" id="text-orgaa68722">
</div>
<ul class="org-ul">
<li><a id="org44a660b"></a>Winds and Brass<br /></li>

<li><a id="org732f9ec"></a>Strings<br /></li>

<li><a id="org31d402c"></a>Voice<br /></li>
</ul>
</div>
<div id="outline-container-org05e9c9d" class="outline-4">
<h4 id="org05e9c9d">s or select passage</h4>
</div>

<div id="outline-container-orge2c1c04" class="outline-4">
<h4 id="orge2c1c04">During input S and shift S</h4>
</div>

<div id="outline-container-orge64a28b" class="outline-4">
<h4 id="orge64a28b">Flipping with X</h4>
</div>

<div id="outline-container-org5d8ad01" class="outline-4">
<h4 id="org5d8ad01">Adjusting handles</h4>
<div class="outline-text-4" id="text-org5d8ad01">
</div>
<ul class="org-ul">
<li><a id="org8b38ef0"></a>Resetting if you mess up<br /></li>

<li><a id="orga2318f7"></a>Disable magnetic for cross staff<br /></li>
</ul>
</div>
<div id="outline-container-orgf77b23c" class="outline-4">
<h4 id="orgf77b23c">Adjusting ends when extending over breaks</h4>
</div>
</div>
<div id="outline-container-org37e2d00" class="outline-3">
<h3 id="org37e2d00">Articulations</h3>
<div class="outline-text-3" id="text-org37e2d00">
</div>
<div id="outline-container-org1f1e0c2" class="outline-4">
<h4 id="org1f1e0c2">Except in two stemmed, it goes over the noteheads</h4>
<div class="outline-text-4" id="text-org1f1e0c2">
</div>
<ul class="org-ul">
<li><a id="orga7e4746"></a>Or limited space below, and except the marcato (sibelius won't let you flip it)<br /></li>
</ul>
</div>
<div id="outline-container-org43f5669" class="outline-4">
<h4 id="org43f5669">Double stemmed</h4>
<div class="outline-text-4" id="text-org43f5669">
</div>
<ul class="org-ul">
<li><a id="org7018280"></a>Each voice needs its own articulations, including unisons!<br /></li>

<li><a id="org57170d4"></a>Aritculations go to the stem side<br />
<ul class="org-ul">
<li><a id="org77e4132"></a>Don't move it closer than the end of the stem!<br /></li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-org1833886" class="outline-4">
<h4 id="org1833886">During input and after input</h4>
</div>

<div id="outline-container-org9a5f9e4" class="outline-4">
<h4 id="org9a5f9e4">Clearing articulations</h4>
</div>

<div id="outline-container-org37d74f7" class="outline-4">
<h4 id="org37d74f7">Flip with X</h4>
</div>
</div>
<div id="outline-container-orgd995159" class="outline-3">
<h3 id="orgd995159">Grace Notes</h3>
<div class="outline-text-3" id="text-orgd995159">
</div>
<div id="outline-container-orgf7996c3" class="outline-4">
<h4 id="orgf7996c3">Always stem up except double stemmed writing</h4>
</div>

<div id="outline-container-orgdd0a84e" class="outline-4">
<h4 id="orgdd0a84e">Slurs below notehead (sibelius won't do this automatically!)</h4>
</div>

<div id="outline-container-org3303151" class="outline-4">
<h4 id="org3303151">Independent slurs, even when slur is long</h4>
</div>

<div id="outline-container-org03e4f70" class="outline-4">
<h4 id="org03e4f70">Articulations where they are conspicuous (sibelius doesn't do this automatically!)</h4>
</div>

<div id="outline-container-org4633f3f" class="outline-4">
<h4 id="org4633f3f">Dynamics tend to go to main note unless there are a lot of grace notes</h4>
</div>
</div>
<div id="outline-container-org7cd4153" class="outline-3">
<h3 id="org7cd4153">Beams</h3>
<div class="outline-text-3" id="text-org7cd4153">
</div>
<div id="outline-container-orge38c1be" class="outline-4">
<h4 id="orge38c1be">Sibelius usually good on secondary beams, but not always (3/8 eg)</h4>
</div>

<div id="outline-container-org99f51a5" class="outline-4">
<h4 id="org99f51a5">Manually add a secondary beam for 4 64ths notes</h4>
</div>

<div id="outline-container-orgf67679c" class="outline-4">
<h4 id="orgf67679c">Global change</h4>
</div>

<div id="outline-container-org893e6b6" class="outline-4">
<h4 id="org893e6b6">Feathered Beams</h4>
</div>

<div id="outline-container-org8007efc" class="outline-4">
<h4 id="org8007efc">over rests</h4>
</div>
</div>
</div>
<div id="outline-container-org099212d" class="outline-2">
<h2 id="org099212d">Class 6 9/19/2023</h2>
<div class="outline-text-2" id="text-org099212d">
</div>
<div id="outline-container-org18ffebc" class="outline-3">
<h3 id="org18ffebc">Dynamics</h3>
<div class="outline-text-3" id="text-org18ffebc">
</div>
<div id="outline-container-orgb8d6c9c" class="outline-4">
<h4 id="orgb8d6c9c">Hairpins</h4>
<div class="outline-text-4" id="text-orgb8d6c9c">
</div>
<ul class="org-ul">
<li><a id="org7e82aec"></a>H and Shift H and Shift L during input, alt arrows to select handles<br /></li>

<li><a id="orgb0f941e"></a>Multiple at once<br /></li>
</ul>
</div>
</div>
