org-roam/20250623135509-3553_fall_2023.org
**** Roman Bold, Italic, Roman Normal

*** One at a time

*** Copy with shift alt click vs alt click

*** Alt click to get same style

*** Multi select (first notes of measures only?)

*** Align in column

** Tempo Marks
*** System Object Positions in Appearance Tab
*** Align them
*** Modulations with = signs

** Expressions and Technique text

*** position (esp with lyrics)

*** Center dynamics, sibelius won't do this for you!!!


* Class 7 9/21/2023
** Glissandi

*** At least first occurance should have word gliss.

*** Make sure it isn't confused with voice leading lines

*** With accidentals, default is next to, but can also adjust

*** Unisons go in direction of gliss (auto)

*** Avoid clef changes

*** Use ties if gliss delayed

*** Chord glisses only one label (not automatic)

*** Finishing grace note and parenthesis

*** Intermediate notes and parenthesis

** Trills

*** Only long slurs and octave signs go above the trill

*** Line lasts for entire note (sib doesn't follow ties), stops right at next notehead or its accidental (sib won't notice) or to barline

*** Accidental by creating a new symbol and a new line

*** Grace note for a defined pitch in parenthesis with an X shift, hide flag, drag stem down

*** Grace note terminations

** Tremolos

*** input at half value, choose beam numbers

*** tied to next measure with slurs

*** break beams (auto?)

** Arpeggios

*** Extends all notes (not stems)

*** Cross staff if there's an accidental

** Octave Signs

*** Above almost all other notation

*** Slur vs triplet vs octave depend on longest

*** Change style if wanted

*** How long it goes controversy

*** Ledger lines, octave signs, or clef changes?

*** loco to turn back


* Class 8 9/26/2023
** Repeats

** Pauses

** Instruments on the side

** System break character by itself?

** Rehearsal Marks

** Brackets

** Figured Bass

** Bar numbers

** Noteheads

** Barlines



* Class 9 9/28/2023

** Page Layout

** Focus On Staffs

** Hiding Staffs

** Spacing, margins, page size

** Magnetic Layout

* Class 10 10/3/2023

** Dynamic Parts

*** When to use which?

** Extracting Parts

** Cues

* Class 11 10/5/2023

** Midterm Projects

* Class 12 10/10/2023

** Midterm Projects

* Class 13 10/12/20232

** Midterm Projects

* Fundamentals of Notation

** Double Stemmed Writing                                                 :2:

*** Rests - 36

*** Articulations - 118
** Accidentals                                                            :2:

*** Where they apply - 78-79

*** Right after a barline - 81

*** Octave displacement - 82

*** Cautionary accidentals - 83

*** Note spelling - 85
** Drumset 281                                                            :3:
** Braces 303                                                             :3:
** Split beams 314                                                        :3:
** Pedaling 334                                                           :3:
** Vocal writing 434                                                      :4:
** Clef Changes                                                           :5:

*** Ledger Lines  - 7

*** At Beginning of the bar, mid measure, after rests - 8
** Key Changes                                                            :5:

