docs/site/20250623135509-3553_fall_2023.html
<div id="outline-container-org3b1418d" class="outline-3">
<h3 id="org3b1418d">Text in General</h3>
<div class="outline-text-3" id="text-org3b1418d">
</div>
<div id="outline-container-org15cc102" class="outline-4">
<h4 id="org15cc102">Fonts</h4>
<div class="outline-text-4" id="text-org15cc102">
</div>
<ul class="org-ul">
<li><a id="orgcbff02f"></a>Roman Bold, Italic, Roman Normal<br /></li>
</ul>
</div>
<div id="outline-container-orgdd1be1f" class="outline-4">
<h4 id="orgdd1be1f">One at a time</h4>
</div>

<div id="outline-container-org637cf09" class="outline-4">
<h4 id="org637cf09">Copy with shift alt click vs alt click</h4>
</div>

<div id="outline-container-org704e022" class="outline-4">
<h4 id="org704e022">Alt click to get same style</h4>
</div>

<div id="outline-container-org7f5a89a" class="outline-4">
<h4 id="org7f5a89a">Multi select (first notes of measures only?)</h4>
</div>

<div id="outline-container-org16a4662" class="outline-4">
<h4 id="org16a4662">Align in column</h4>
</div>
</div>
<div id="outline-container-orgfa8af95" class="outline-3">
<h3 id="orgfa8af95">Tempo Marks</h3>
<div class="outline-text-3" id="text-orgfa8af95">
</div>
<div id="outline-container-orgd9e8a54" class="outline-4">
<h4 id="orgd9e8a54">System Object Positions in Appearance Tab</h4>
</div>
<div id="outline-container-org45b3d66" class="outline-4">
<h4 id="org45b3d66">Align them</h4>
</div>
<div id="outline-container-org71faca7" class="outline-4">
<h4 id="org71faca7">Modulations with = signs</h4>
</div>
</div>
<div id="outline-container-org8e639c0" class="outline-3">
<h3 id="org8e639c0">Expressions and Technique text</h3>
<div class="outline-text-3" id="text-org8e639c0">
</div>
<div id="outline-container-org05657dc" class="outline-4">
<h4 id="org05657dc">position (esp with lyrics)</h4>
</div>

<div id="outline-container-orgc26b7bf" class="outline-4">
<h4 id="orgc26b7bf">Center dynamics, sibelius won't do this for you!!!</h4>
</div>
</div>
</div>
<div id="outline-container-org91006a5" class="outline-2">
<h2 id="org91006a5">Class 7 9/21/2023</h2>
<div class="outline-text-2" id="text-org91006a5">
</div>
<div id="outline-container-org5ffb51e" class="outline-3">
<h3 id="org5ffb51e">Glissandi</h3>
<div class="outline-text-3" id="text-org5ffb51e">
</div>
<div id="outline-container-orga2bfbe2" class="outline-4">
<h4 id="orga2bfbe2">At least first occurance should have word gliss.</h4>
</div>

<div id="outline-container-org008f5f6" class="outline-4">
<h4 id="org008f5f6">Make sure it isn't confused with voice leading lines</h4>
</div>

<div id="outline-container-org342d0f4" class="outline-4">
<h4 id="org342d0f4">With accidentals, default is next to, but can also adjust</h4>
</div>

<div id="outline-container-orgccecbc5" class="outline-4">
<h4 id="orgccecbc5">Unisons go in direction of gliss (auto)</h4>
</div>

<div id="outline-container-org6fbea57" class="outline-4">
<h4 id="org6fbea57">Avoid clef changes</h4>
</div>

<div id="outline-container-org2fc63b4" class="outline-4">
<h4 id="org2fc63b4">Use ties if gliss delayed</h4>
</div>

<div id="outline-container-orgc1309cc" class="outline-4">
<h4 id="orgc1309cc">Chord glisses only one label (not automatic)</h4>
</div>

<div id="outline-container-org7871709" class="outline-4">
<h4 id="org7871709">Finishing grace note and parenthesis</h4>
</div>

<div id="outline-container-org7b68880" class="outline-4">
<h4 id="org7b68880">Intermediate notes and parenthesis</h4>
</div>
</div>
<div id="outline-container-org0e7a68e" class="outline-3">
<h3 id="org0e7a68e">Trills</h3>
<div class="outline-text-3" id="text-org0e7a68e">
</div>
<div id="outline-container-org95e1ae3" class="outline-4">
<h4 id="org95e1ae3">Only long slurs and octave signs go above the trill</h4>
</div>

<div id="outline-container-orge6ca867" class="outline-4">
<h4 id="orge6ca867">Line lasts for entire note (sib doesn't follow ties), stops right at next notehead or its accidental (sib won't notice) or to barline</h4>
</div>

<div id="outline-container-orgd0900eb" class="outline-4">
<h4 id="orgd0900eb">Accidental by creating a new symbol and a new line</h4>
</div>

<div id="outline-container-org1bd1d94" class="outline-4">
<h4 id="org1bd1d94">Grace note for a defined pitch in parenthesis with an X shift, hide flag, drag stem down</h4>
</div>

<div id="outline-container-orgf95bca4" class="outline-4">
<h4 id="orgf95bca4">Grace note terminations</h4>
</div>
</div>
<div id="outline-container-org8290802" class="outline-3">
<h3 id="org8290802">Tremolos</h3>
<div class="outline-text-3" id="text-org8290802">
</div>
<div id="outline-container-org29b98ca" class="outline-4">
<h4 id="org29b98ca">input at half value, choose beam numbers</h4>
</div>

<div id="outline-container-org81477f8" class="outline-4">
<h4 id="org81477f8">tied to next measure with slurs</h4>
</div>

<div id="outline-container-org661d9c4" class="outline-4">
<h4 id="org661d9c4">break beams (auto?)</h4>
</div>
</div>
<div id="outline-container-org9103aea" class="outline-3">
<h3 id="org9103aea">Arpeggios</h3>
<div class="outline-text-3" id="text-org9103aea">
</div>
<div id="outline-container-orgdfc64ac" class="outline-4">
<h4 id="orgdfc64ac">Extends all notes (not stems)</h4>
</div>

<div id="outline-container-org1ec42c0" class="outline-4">
<h4 id="org1ec42c0">Cross staff if there's an accidental</h4>
</div>
</div>
<div id="outline-container-orgc7a5dc1" class="outline-3">
<h3 id="orgc7a5dc1">Octave Signs</h3>
<div class="outline-text-3" id="text-orgc7a5dc1">
</div>
<div id="outline-container-org22c1601" class="outline-4">
<h4 id="org22c1601">Above almost all other notation</h4>
</div>

<div id="outline-container-orge93d31d" class="outline-4">
<h4 id="orge93d31d">Slur vs triplet vs octave depend on longest</h4>
</div>

<div id="outline-container-org752859d" class="outline-4">
<h4 id="org752859d">Change style if wanted</h4>
</div>

<div id="outline-container-orgedefd73" class="outline-4">
<h4 id="orgedefd73">How long it goes controversy</h4>
</div>

<div id="outline-container-org43332e8" class="outline-4">
<h4 id="org43332e8">Ledger lines, octave signs, or clef changes?</h4>
</div>

<div id="outline-container-org16d1870" class="outline-4">
<h4 id="org16d1870">loco to turn back</h4>
</div>
</div>
</div>
<div id="outline-container-org7a2733e" class="outline-2">
<h2 id="org7a2733e">Class 8 9/26/2023</h2>
<div class="outline-text-2" id="text-org7a2733e">
</div>
<div id="outline-container-org46ddffa" class="outline-3">
<h3 id="org46ddffa">Repeats</h3>
</div>

<div id="outline-container-org40a9ea8" class="outline-3">
<h3 id="org40a9ea8">Pauses</h3>
</div>

<div id="outline-container-org50a4e1a" class="outline-3">
<h3 id="org50a4e1a">Instruments on the side</h3>
</div>

<div id="outline-container-org05163da" class="outline-3">
<h3 id="org05163da">System break character by itself?</h3>
</div>

<div id="outline-container-org50aac70" class="outline-3">
<h3 id="org50aac70">Rehearsal Marks</h3>
</div>

<div id="outline-container-orgd6437b6" class="outline-3">
<h3 id="orgd6437b6">Brackets</h3>
</div>

<div id="outline-container-org30aa2ea" class="outline-3">
<h3 id="org30aa2ea">Figured Bass</h3>
</div>

<div id="outline-container-org6c53efb" class="outline-3">
<h3 id="org6c53efb">Bar numbers</h3>
</div>

<div id="outline-container-org7f79a5d" class="outline-3">
<h3 id="org7f79a5d">Noteheads</h3>
</div>

<div id="outline-container-org672a97a" class="outline-3">
<h3 id="org672a97a">Barlines</h3>
</div>
</div>
<div id="outline-container-org5b484b1" class="outline-2">
<h2 id="org5b484b1">Class 9 9/28/2023</h2>
<div class="outline-text-2" id="text-org5b484b1">
</div>
<div id="outline-container-org7cf7768" class="outline-3">
<h3 id="org7cf7768">Page Layout</h3>
</div>

<div id="outline-container-org4810696" class="outline-3">
<h3 id="org4810696">Focus On Staffs</h3>
</div>

<div id="outline-container-orgea10850" class="outline-3">
<h3 id="orgea10850">Hiding Staffs</h3>
</div>

<div id="outline-container-org50af96c" class="outline-3">
<h3 id="org50af96c">Spacing, margins, page size</h3>
</div>

<div id="outline-container-org571db8b" class="outline-3">
<h3 id="org571db8b">Magnetic Layout</h3>
</div>
</div>
<div id="outline-container-org72c8627" class="outline-2">
<h2 id="org72c8627">Class 10 10/3/2023</h2>
<div class="outline-text-2" id="text-org72c8627">
</div>
<div id="outline-container-org6853c1c" class="outline-3">
<h3 id="org6853c1c">Dynamic Parts</h3>
<div class="outline-text-3" id="text-org6853c1c">
</div>
<div id="outline-container-org3d1c642" class="outline-4">
<h4 id="org3d1c642">When to use which?</h4>
</div>
</div>
<div id="outline-container-org0e30181" class="outline-3">
<h3 id="org0e30181">Extracting Parts</h3>
</div>

<div id="outline-container-org68e2a0a" class="outline-3">
<h3 id="org68e2a0a">Cues</h3>
</div>
</div>
<div id="outline-container-org2b7a4d8" class="outline-2">
<h2 id="org2b7a4d8">Class 11 10/5/2023</h2>
<div class="outline-text-2" id="text-org2b7a4d8">
</div>
<div id="outline-container-org33f2a83" class="outline-3">
<h3 id="org33f2a83">Midterm Projects</h3>
</div>
</div>
<div id="outline-container-orgbf99a87" class="outline-2">
<h2 id="orgbf99a87">Class 12 10/10/2023</h2>
<div class="outline-text-2" id="text-orgbf99a87">
</div>
<div id="outline-container-org1027603" class="outline-3">
<h3 id="org1027603">Midterm Projects</h3>
</div>
</div>
<div id="outline-container-org4128a70" class="outline-2">
<h2 id="org4128a70">Class 13 10/12/20232</h2>
<div class="outline-text-2" id="text-org4128a70">
</div>
<div id="outline-container-org07c0e44" class="outline-3">
<h3 id="org07c0e44">Midterm Projects</h3>
</div>
</div>
<div id="outline-container-orgf1481eb" class="outline-2">
<h2 id="orgf1481eb">Fundamentals of Notation</h2>
<div class="outline-text-2" id="text-orgf1481eb">
</div>
<div id="outline-container-org7e39416" class="outline-3">
<h3 id="org7e39416">Double Stemmed Writing&#xa0;&#xa0;&#xa0;<span class="tag"><span class="2">2</span></span></h3>
<div class="outline-text-3" id="text-org7e39416">
</div>
<div id="outline-container-org294c4c7" class="outline-4">
<h4 id="org294c4c7">Rests - 36</h4>
</div>

<div id="outline-container-org3f4ff63" class="outline-4">
<h4 id="org3f4ff63">Articulations - 118</h4>
</div>
</div>
<div id="outline-container-org0247b4c" class="outline-3">
<h3 id="org0247b4c">Accidentals&#xa0;&#xa0;&#xa0;<span class="tag"><span class="2">2</span></span></h3>
<div class="outline-text-3" id="text-org0247b4c">
</div>
<div id="outline-container-org7dce9b3" class="outline-4">
<h4 id="org7dce9b3">Where they apply - 78-79</h4>
</div>

<div id="outline-container-orgcf72448" class="outline-4">
<h4 id="orgcf72448">Right after a barline - 81</h4>
</div>

<div id="outline-container-orge06ef5f" class="outline-4">
<h4 id="orge06ef5f">Octave displacement - 82</h4>
</div>

<div id="outline-container-org1d4993e" class="outline-4">
<h4 id="org1d4993e">Cautionary accidentals - 83</h4>
</div>

<div id="outline-container-org589a9d3" class="outline-4">
<h4 id="org589a9d3">Note spelling - 85</h4>
</div>
</div>
<div id="outline-container-org241d714" class="outline-3">
<h3 id="org241d714">Drumset 281&#xa0;&#xa0;&#xa0;<span class="tag"><span class="3">3</span></span></h3>
</div>
<div id="outline-container-orgff1bad1" class="outline-3">
<h3 id="orgff1bad1">Braces 303&#xa0;&#xa0;&#xa0;<span class="tag"><span class="3">3</span></span></h3>
</div>
<div id="outline-container-org15cf397" class="outline-3">
<h3 id="org15cf397">Split beams 314&#xa0;&#xa0;&#xa0;<span class="tag"><span class="3">3</span></span></h3>
</div>
<div id="outline-container-orgf5e8ba7" class="outline-3">
<h3 id="orgf5e8ba7">Pedaling 334&#xa0;&#xa0;&#xa0;<span class="tag"><span class="3">3</span></span></h3>
</div>
<div id="outline-container-org45432d8" class="outline-3">
<h3 id="org45432d8">Vocal writing 434&#xa0;&#xa0;&#xa0;<span class="tag"><span class="4">4</span></span></h3>
</div>
<div id="outline-container-org23a5a4a" class="outline-3">
<h3 id="org23a5a4a">Clef Changes&#xa0;&#xa0;&#xa0;<span class="tag"><span class="5">5</span></span></h3>
<div class="outline-text-3" id="text-org23a5a4a">
</div>
<div id="outline-container-org130c6fe" class="outline-4">
<h4 id="org130c6fe">Ledger Lines  - 7</h4>
</div>

<div id="outline-container-org6dc95d1" class="outline-4">
<h4 id="org6dc95d1">At Beginning of the bar, mid measure, after rests - 8</h4>
</div>
</div>
