org-roam/20250623135509-3553_fall_2023.org
*** Double bar line - 39

** Tuplets 193                                                            :5:
** Tempo Marks 182                                                        :5:
** Meter                                                                  :5:

*** Rests 160

*** Syncopation - 170

*** Simple to Compound - 172

** Articulations                                                          :6:

*** Placement - 117

*** Double stemmed placement - 118

*** Arpeggiated Chords - 131
** Dynamics                                                               :6:

*** Typefaces - 101

*** Placement - 101-103

*** Hairpins vs words 106

*** subito 107

** Ties                                                                   :7:

*** Only same note - 60

*** Flattening in chords - 61

*** Distance between ties - 66
** Slurs                                                                  :7:

*** Over a break - 112

*** Chords - 114

** Octave Signs                                                           :8:

*** Where its placed -28

*** Precedence of slurs, octaves, and tuplets, Tempo Markings, pedal instructions - 29

*** Extension Lines - 30

*** Octave signs vs ledger liens - 33
** Grace Notes - 126                                                      :8:
** Trills 135                                                             :8:

*** Accidentals with trills - 84

** Glissandi                                                              :8:
** Pauses                                                                 :9:

*** ' and // 187

*** Fermata 187-188

** Repeats 219                                                            :9:

*** Slash notation 219

*** Tremolos 225

*** Beat repetition 230

*** Repeat barlines 233

*** DC and DS 238

** Page Layout                                                           :10:
** Extracting Parts                                                      :11:
